Repository: imcat-owo/dudu-native
Catalog: Dudu/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

source: Opens the app
zh_hans: 打开 App
zh_hant: 打開 App

source: Runs in background
zh_hans: 后台运行
zh_hant: 背景執行

source: Also in the Shortcuts app, under All Actions.
zh_hans: 在捷径 App 的「全部动作」里也能找到。
zh_hant: 在捷徑 App 的「全部動作」裡也能找到。

source: Add to Siri
zh_hans: 添加到 Siri
zh_hant: 加入到 Siri

source: On a schedule
zh_hans: 定时
zh_hant: 定時

source: Wake Dudu on a schedule
zh_hans: 定时叫醒嘟嘟
zh_hant: 定時叫醒嘟嘟

source: A notification at your chosen time — tap it and Dudu runs your preset prompt.
zh_hans: 到点发一条通知，点一下，嘟嘟就按你写好的话开工。
zh_hant: 到點發一條通知，點一下，嘟嘟就按你寫好的話開工。

source: Scheduled Prompts
zh_hans: 定时提醒
zh_hant: 定時提醒

source: Ask Dudu
zh_hans: 问嘟嘟
zh_hant: 問嘟嘟

source: Talk to Dudu out loud — she opens the chat, sends your words, and answers right in front of you.
zh_hans: 直接跟嘟嘟说话——她会打开聊天，把你的话发出去，当场回答你。
zh_hant: 直接跟嘟嘟說話——她會打開聊天，把你的話發出去，當場回答你。

source: Quick Task
zh_hans: 快捷任务
zh_hant: 快捷任務

source: Little everyday jobs — sleep check, weather, morning briefing. Pick one and Dudu handles it.
zh_hans: 日常小任务——睡眠复盘、查天气、晨间简报，选一个，嘟嘟搞定。
zh_hant: 日常小任務——睡眠復盤、查天氣、晨間簡報，選一個，嘟嘟搞定。

source: Send Prompt
zh_hans: 发任务
zh_hant: 發任務

source: Slip Dudu a task in the background — she keeps working while you do other things.
zh_hans: 悄悄给嘟嘟塞个后台任务——你忙你的，她接着干。
zh_hant: 悄悄給嘟嘟塞個背景任務——你忙你的，她接著幹。

source: Session Status
zh_hans: 任务状态
zh_hant: 任務狀態

source: Peek at a running task — see what Dudu is up to and what she just said.
zh_hans: 瞄一眼正在跑的任务——看看嘟嘟在干嘛、刚说了什么。
zh_hant: 瞄一眼正在跑的任務——看看嘟嘟在幹嘛、剛說了什麼。

source: List Sessions
zh_hans: 聊天列表
zh_hant: 聊天列表

source: All your chats with Dudu, in one tidy list.
zh_hans: 你和嘟嘟的所有聊天，一张清单收好。
zh_hant: 你和嘟嘟的所有聊天，一張清單收好。

source: Follow Up
zh_hans: 继续聊
zh_hant: 繼續聊

source: Wake an old conversation with one more question — Dudu picks up right where you left off.
zh_hans: 用一个问题叫醒旧对话——嘟嘟接着上次的地方继续。
zh_hant: 用一個問題叫醒舊對話——嘟嘟接著上次的地方繼續。

source: Open Session
zh_hans: 打开聊天
zh_hant: 打開聊天

source: Jump straight into a chat — no scrolling through the list.
zh_hans: 一头扎进某个聊天——不用在列表里翻。
zh_hant: 一頭扎進某個聊天——不用在列表裡翻。

source: Retry Run
zh_hans: 重跑一次
zh_hant: 重跑一次

source: Dudu went sideways? Rewind to any of your messages and let her try that turn again.
zh_hans: 嘟嘟跑偏了？回到你的任意一条消息，让她那一轮重来。
zh_hant: 嘟嘟跑偏了？回到你的任意一條消息，讓她那一輪重來。

# term.commandPlaceholder
source: Type a command
zh_hans: 输入命令
zh_hant: 輸入命令

# sandbox.relay.badHost
source: Invalid relay host
zh_hans: 中继地址无效
zh_hant: 中繼地址無效

# sandbox.relay.probeFailed
source: Relay probe failed
zh_hans: 中继探测失败
zh_hant: 中繼探測失敗

# sandbox.relay.requestFailed
source: Relay request failed
zh_hans: 中继请求失败
zh_hant: 中繼請求失敗

# sandbox.relay.unreachable
source: Relay unreachable
zh_hans: 中继不可达
zh_hant: 中繼不可達

# orchestration.noGroups
source: No groups yet — add the first one.
zh_hans: 还没有分组，加一个。
zh_hant: 還沒有分組，加一個。

source: Shell execution is unavailable: the iSH sandbox backend is not installed yet. The command was NOT run. Do not retry shell_execute until the backend is available.
zh_hans: Shell 执行不可用：iSH 沙箱后端尚未安装。该命令未被执行。在后端可用之前，请勿重试 shell_execute。
zh_hant: Shell 執行不可用：iSH 沙箱後端尚未安裝。該命令未被執行。在後端可用之前，請勿重試 shell_execute。

# manualsetup.title
source: Manual entry
zh_hans: 手动填写
zh_hant: 手動填寫

# manualsetup.customSection
source: Custom
zh_hans: 自定义
zh_hant: 自訂

# manualsetup.presetSection
source: Preset services
zh_hans: 预设服务
zh_hant: 預設服務

# manualsetup.customRow
source: Manual entry
zh_hans: 手动填写
zh_hant: 手動填寫

# manualsetup.customRowSubtitle
source: Fill in base URL, API key and model yourself
zh_hans: 自己填 Base URL + API Key + 模型
zh_hant: 自己填 Base URL + API Key + 模型

# manualsetup.chooseMethod
source: Choose a setup method
zh_hans: 选择添加方式
zh_hant: 選擇新增方式

# manualsetup.viaOAuth
source: OAuth sign-in
zh_hans: OAuth 登录
zh_hant: OAuth 登入

# manualsetup.viaManual
source: Enter API key manually
zh_hans: 手动填写 API Key
zh_hant: 手動填寫 API Key

# manualsetup.typeSubtitleBoth
source: OAuth sign-in / manual entry
zh_hans: OAuth 登录 / 手动填写
zh_hant: OAuth 登入 / 手動填寫

# manualsetup.name
source: Name
zh_hans: 名称
zh_hant: 名稱

# manualsetup.namePlaceholder
source: e.g. My relay
zh_hans: 如：我的中转
zh_hant: 如：我的中轉

# manualsetup.protocol
source: API protocol
zh_hans: 接口协议
zh_hant: 介面協定

# manualsetup.protocol.openai
source: OpenAI-compatible
zh_hans: OpenAI 兼容
zh_hant: OpenAI 相容

# manualsetup.protocol.anthropic
source: Anthropic-compatible
zh_hans: Anthropic 兼容
zh_hant: Anthropic 相容

# manualsetup.baseURLHint
source: Leave empty to use the official default
zh_hans: 留空使用官方默认地址
zh_hant: 留空使用官方預設位址

# manualsetup.openrouterNote
source: OpenRouter uses its official endpoint; no address needed
zh_hans: OpenRouter 使用官方接口，无需填写地址
zh_hant: OpenRouter 使用官方介面，無需填寫位址

# manualsetup.apiKeyPlaceholder
source: Paste API key
zh_hans: 粘贴 API Key
zh_hant: 貼上 API Key

# manualsetup.showKey
source: Show
zh_hans: 显示
zh_hant: 顯示

# manualsetup.hideKey
source: Hide
zh_hans: 隐藏
zh_hant: 隱藏

# manualsetup.appendV1
source: Append /v1 automatically
zh_hans: 自动追加 /v1
zh_hant: 自動附加 /v1

# manualsetup.test
source: Test connection
zh_hans: 测试连接
zh_hant: 測試連線

# manualsetup.testing
source: Connecting…
zh_hans: 正在连接…
zh_hant: 正在連線…

# manualsetup.testSuccessCount
source: Connected · %d models fetched
zh_hans: 连接成功 · 拉取到 %d 个模型
zh_hant: 連線成功 · 拉取到 %d 個模型

# manualsetup.testEmpty
source: Connected, but the API returned no model list. Add model names manually below.
zh_hans: 连接成功，但接口未返回模型列表，请在下方手动填写模型名称
zh_hant: 連線成功，但介面未回傳模型清單，請在下方手動填寫模型名稱

# manualsetup.testFailed
source: Connection failed
zh_hans: 连接失败
zh_hant: 連線失敗

# manualsetup.models
source: Models
zh_hans: 模型
zh_hant: 模型

# manualsetup.modelNamePlaceholder
source: Model ID (e.g. gpt-4o)
zh_hans: 模型 ID（如 gpt-4o）
zh_hant: 模型 ID（如 gpt-4o）

# manualsetup.addModel
source: Add
zh_hans: 添加
zh_hant: 新增

# manualsetup.moreModels
source: %d more
zh_hans: 还有 %d 个
zh_hant: 還有 %d 個

# manualsetup.save
source: Save
zh_hans: 保存
zh_hant: 儲存

# manualsetup.cancel
source: Cancel
zh_hans: 取消
zh_hant: 取消

# manualsetup.keySaveFailed
source: Keychain save failed (error %d); the key was not saved
zh_hans: 钥匙串保存失败（错误码 %d），Key 没有保存
zh_hant: 鑰匙圈儲存失敗（錯誤碼 %d），Key 沒有儲存

# manualsetup.invalidBaseURL
source: Invalid base URL — must start with http:// or https://
zh_hans: Base URL 格式不正确，需以 http:// 或 https:// 开头
zh_hant: Base URL 格式不正確，需以 http:// 或 https:// 開頭

# manualsetup.needName
source: Please enter a service name first
zh_hans: 请先填写服务名称
zh_hant: 請先填寫服務名稱

# manualsetup.needKey
source: Please enter an API key first
zh_hans: 请先填写 API Key
zh_hant: 請先填寫 API Key

# manualsetup.errInvalidKey
source: Invalid key (401/403) — please check the key
zh_hans: Key 无效（401/403），请检查 Key 是否正确
zh_hant: Key 無效（401/403），請檢查 Key 是否正確

# manualsetup.errNetwork
source: Network error: %@
zh_hans: 网络错误：%@
zh_hant: 網路錯誤：%@

# manualsetup.errDecoding
source: The API returned data that could not be parsed
zh_hans: 接口返回了无法解析的数据
zh_hant: 介面回傳了無法解析的資料

# manualsetup.errRateLimited
source: Rate limited — please try again later
zh_hans: 请求被限流，请稍后再试
zh_hant: 請求被限流，請稍後再試

# manualsetup.errCancelled
source: Request cancelled
zh_hans: 请求已取消
zh_hant: 請求已取消

# manualsetup.errUnknown
source: Unknown error
zh_hans: 未知错误
zh_hant: 未知錯誤

# manualsetup.fetchModels
source: Fetch model list
zh_hans: 拉取模型列表
zh_hant: 拉取模型清單

# manualsetup.fetchSuccessCount
source: Model list updated (%d models)
zh_hans: 已更新 %d 个模型
zh_hant: 已更新 %d 個模型

# manualsetup.fetchEmptyKept
source: The API returned no model list; the existing list was kept
zh_hans: 接口未返回模型列表，已保留现有列表
zh_hant: 介面未回傳模型清單，已保留現有清單

# manualsetup.connection
source: Connection
zh_hans: 连接
zh_hant: 連線

# manualsetup.baseURL
source: Base URL
zh_hans: 接口地址
zh_hant: 介面地址

# tab.ourSpace
source: Us
zh_hans: 我们
zh_hant: 我們

# tab.library
source: Library
zh_hans: 资料
zh_hant: 資料

# tab.more
source: More
zh_hans: 更多
zh_hant: 更多

# library.filesSection
source: Files
zh_hans: 文件
zh_hant: 檔案
